// задание 1//
// let i = 0;
// while (i <2) {
//     console.log ("Привет");
//     i++
// }
// задание 2//
// let i = 1;
// while (i <= 5) {
//     console.log(i);
//     i++;
// }
// задание 3//
// let i = 7;
// while (i >= 7 && i<=22) {
//     console.log(i);
//     i++;
// }

//задание 4//
// const obj = {
//     "Коля": "200",
//     "Вася": "300",
//     "Петя": "400",
//   }
  
//   for (const key in obj) {
//     console.log(`${key}-зарплата-${obj[key]} долларов`);
//   }

// задание 5//
// let n = 1000;
// let num = 0;
// while (n >= 50) {
//   n /= 2;
//   num++;
// }
// console.log(`Число после деления: ${n}`);
// console.log(`Количество итераций: ${num}`);

//задание 6//
// const firstFriday = 5; // предположим, что первая пятница месяца приходится на 4 число

// for (let day = 1; day <= 31; day++) {
//   if ((day - firstFriday) % 7 === 0) {
//     console.log(`Сегодня пятница ${day}-е число. Необходимо подготовить отчёт.`);
//   }
// }
